package com.example.codingrelay

/// 整数 n が与えられたとき、1から n までの数を順番に出力するFizzBuzz配列を作成する関数を実装してください。
/// ただし、配列内の各要素は以下のルールに従って文字列として出力してください。
/// 数が3の倍数の場合は "Fizz" を出力する（数自体は出力しない）。
/// 数が5の倍数の場合は "Buzz" を出力する（数自体は出力しない）。
/// 数が3の倍数かつ5の倍数の場合は "FizzBuzz" を出力する（数自体は出力しない）。
/// 上記以外の場合は数値をそのまま文字列として出力する。
///
/// 例 1:
/// 入力: n = 3
/// 出力: ["1", "2", "Fizz"]
///
/// 例 2:
/// 入力: n = 5
/// 出力: ["1", "2", "Fizz", "4", "Buzz"]
///
/// 例 3:
/// 入力: n = 15
/// 出力: ["1", "2", "Fizz", "4", "Buzz", "Fizz", "7", "8", "Fizz", "Buzz", "11", "Fizz", "13", "14", "FizzBuzz"]
///
/// 制約:
/// 1 <= n <= 10⁴

object FizzBuzz {
    fun execute(n: Int): List<String> {
        return listOf("")
    }
}